
> storage_init Meta

> pf 100 139100 "" 139101,139102,139103,139104,139105

> pc admin 20011002 100 139100 001 "139102=test1,139104=1024"
001

> ~mkdir test1

> 
> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 256 100:139100] 001,test1,1024,1024,bad access

> pe admin 20011002 100 139100 001 139410
Status Info has changed.

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,1024,1024,okay

> pc admin 20011002 100 139100 002 "139102=test2,139104=4096"
002

> pc admin 20011002 100 139100 003 "139102=test3,139104=8192"
003

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,1024,1024,okay
[002 =1.0 256 100:139100] 002,test2,4096,4096,bad access
[003 =1.0 256 100:139100] 003,test3,8192,8192,bad access

> ~mkdir test2

> 
> pe admin 20011002 100 139100 002 139410
Status Info has changed.

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,1024,1024,okay
[002 =1.0 0 100:139100] 002,test2,4096,4096,okay
[003 =1.0 256 100:139100] 003,test3,8192,8192,bad access

> ~mkdir test3

> 
> pe admin 20011002 100 139100 003 139410
Status Info has changed.

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,1024,1024,okay
[002 =1.0 0 100:139100] 002,test2,4096,4096,okay
[003 =1.0 0 100:139100] 003,test3,8192,8192,okay

> file_archives
001 [okay      ] (0 B/1.0 kB) test1
002 [okay      ] (0 B/4.1 kB) test2
003 [okay      ] (0 B/8.2 kB) test3

> pd admin 20011002 100 139100 001

> pf 100 139100 "" 139101,139102,139103,139104,139105
[002 =1.0 0 100:139100] 002,test2,4096,4096,okay
[003 =1.0 0 100:139100] 003,test3,8192,8192,okay

> pd admin 20011002 100 139100 002

> pf 100 139100 "" 139101,139102,139103,139104,139105
[003 =1.0 0 100:139100] 003,test3,8192,8192,okay

> pd admin 20011002 100 139100 003

> pf 100 139100 "" 139101,139102,139103,139104,139105

> ~rmdir test1

> 
> ~rmdir test2

> 
> ~rmdir test3

> 
> 