
> storage_init ciyam

> pf 100 139100 "" 139101,139102,139103,139104,139105

> pc admin 20011002 100 139100 001 "139102=test1"
001

> ~mkdir test1

> 
> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 256 100:139100] 001,test1,10000000,10000000,bad access

> pe admin 20011002 100 139100 001 139410
Status Info has changed.

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,10000000,10000000,okay

> pc admin 20011002 100 139100 002 "139102=test2,139104=2000000,139108=1"
002

> pc admin 20011002 100 139100 003 "139102=test3,139104=4000000,139108=1"
003

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,10000000,10000000,okay
[002 =1.0 256 100:139100] 002,test2,2000000,2000000,bad access
[003 =1.0 256 100:139100] 003,test3,4000000,4000000,bad access

> ~mkdir test2

> 
> pe admin 20011002 100 139100 002 139410
Status Info has changed.

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,10000000,10000000,okay
[002 =1.0 0 100:139100] 002,test2,2000000,2000000,okay
[003 =1.0 256 100:139100] 003,test3,4000000,4000000,bad access

> ~mkdir test3

> 
> pe admin 20011002 100 139100 003 139410
Status Info has changed.

> pf 100 139100 "" 139101,139102,139103,139104,139105
[001 =1.0 0 100:139100] 001,test1,10000000,10000000,okay
[002 =1.0 0 100:139100] 002,test2,2000000,2000000,okay
[003 =1.0 0 100:139100] 003,test3,4000000,4000000,okay

> file_archives
001 [okay      ] (0 B/10.0 MB) test1
002 [okay      ] (0 B/2.0 MB) test2
003 [okay      ] (0 B/4.0 MB) test3

> pd admin 20011002 100 139100 001

> pf 100 139100 "" 139101,139102,139103,139104,139105
[002 =1.0 0 100:139100] 002,test2,2000000,2000000,okay
[003 =1.0 0 100:139100] 003,test3,4000000,4000000,okay

> pd admin 20011002 100 139100 002

> pf 100 139100 "" 139101,139102,139103,139104,139105
[003 =1.0 0 100:139100] 003,test3,4000000,4000000,okay

> pd admin 20011002 100 139100 003

> pf 100 139100 "" 139101,139102,139103,139104,139105

> ~rmdir test1

> 
> ~rmdir test2

> 
> ~rmdir test3

> 
> 